# Задача 1-1
# Ввести два числа x и y.
# Напечатать сумму и произведение этих чисел
# (оператор + и *)

x = float(input("Число Х:"))
y = float(input("Число Y:"))

print(x + y)
print(x * y)