SELECT *
FROM BOOK
ORDER BY author ASC, price DESC
--"book_id"	"title"	"author"	"price"	"amount"	"total"
--7	"Мастер и Маргарита"	"Булгаков"	230	77	17710
--8	"Собачье сердце"	"Булгаков"	160	80	12800
--6	"Вий"	"Гоголь"	345	11	3795
--5	"Мертвые души"	"Гоголь"	190	56	10640
--4	"Ревизор"	"Гоголь"	120	18	2160
--2	"Руслан и Людмила"	"Пушкин"	150	10	1500
--3	"Евгений Онегин"	"Пушкин"	100	34	3400
--1	"Капитанская дочка"	"Пушкин"	100	5	500
--9	"Война и Мир"	"Толстой"	500	10	5000
--10	"Тихий дон"	"Шолохов"	570	46	26220